facebookincubator/oculus-linux-kernel/drivers/staging/oculus/mcu/swd/swd_registers_nrf54l15.h
/* SPDX-License-Identifier: GPL-2.0 */
#ifndef _SWD_REGISTERS_NRF54L15_H
#define _SWD_REGISTERS_NRF54L15_H

/* CTRL-AP registers */
#define SWD_NRF54L15_APSEL_CM33_AHBAP 0x00
#define SWD_NRF54H20_APSEL_AUX_AHBAP 0x01
#define SWD_NRF54H20_APSEL_CTRLAP 0x02

#define SWD_NRF54L15_CTRLAP_RESET 0x000
#define SWD_NRF54L15_CTRLAP_RESET_PinReset (4)
#define SWD_NRF54L15_CTRLAP_RESET_HardReset (2)
#define SWD_NRF54L15_CTRLAP_RESET_Reset (1)
#define SWD_NRF54L15_CTRLAP_RESET_NoReset (0)
#define SWD_NRF54L15_CTRLAP_ERASEALL 0x004
#define SWD_NRF54L15_CTRLAP_ERASEALL_Start (1)
#define SWD_NRF54L15_CTRLAP_ERASEALL_NoOperation (0)
#define SWD_NRF54L15_CTRLAP_ERASEALLSTATUS 0x008
#define SWD_NRF54L15_CTRLAP_ERASEALLSTATUS_Busy (1)
#define SWD_NRF54L15_CTRLAP_ERASEALLSTATUS_Ready (0)

/* RRAM (NVM) Registers*/
#define SWD_NRF54L15_RRAMC_BASE 0x5004B000UL
#define SWD_NRF54L15_RRAMC_READY_OFFSET 0x400
#define SWD_NRF54L15_RRAMC_READY_NEXT_OFFSET 0x404
#define SWD_NRF54L15_RRAMC_CONFIG_OFFSET 0x500
#define SWD_NRF54L15_RRAMC_ERASEALL_OFFSET 0x540

#define SWD_NRF54L15_RRAMC_CONFIG_WEN_Disabled 0x0
#define SWD_NRF54L15_RRAMC_CONFIG_WEN_Enabled 0x1

#define SWD_NRF54L15_RRAMC_READY_Busy 0x0
#define SWD_NRF54L15_RRAMC_READY_Ready 0x1
#define SWD_NRF54L15_RRAMC_READYNEXT_Busy 0x0
#define SWD_NRF54L15_RRAMC_READYNEXT_Ready 0x1
#define SWD_NRF54L15_RRAMC_ERASEALL_NoOp 0x0
#define SWD_NRF54L15_RRAMC_ERASEALL_Erase 0x1

#define SWD_NRF54L15_RRAMC_READY (SWD_NRF54L15_RRAMC_BASE + SWD_NRF54L15_RRAMC_READY_OFFSET)
#define SWD_NRF54L15_RRAMC_READYNEXT (SWD_NRF54L15_RRAMC_BASE + SWD_NRF54L15_RRAMC_READYNEXT_OFFSET)
#define SWD_NRF54L15_RRAMC_CONFIG (SWD_NRF54L15_RRAMC_BASE + SWD_NRF54L15_RRAMC_CONFIG_OFFSET)
#define SWD_NRF54L15_RRAMC_ERASEALL (SWD_NRF54L15_RRAMC_BASE + SWD_NRF54L15_RRAMC_ERASEALL_OFFSET)

#define SWD_NRF54L15_RRAMC_ERASEPAGE_VALUE 0xFFFFFFFF
#define SWD_NRF54L15_RRAMC_START_ADDR 0x00000000

/* FICR Registers */
#define SWD_NRF54L15_FICR_NS_BASE 0x00FFC000UL

#define SWD_NRF54L15_FICR_PART_OFFSET 0x31C
#define SWD_NRF54L15_FICR_VARIANT_OFFSET 0x320

#define SWD_NRF54L15_FICR_PART (SWD_NRF54L15_FICR_NS_BASE + SWD_NRF54L15_FICR_PART_OFFSET)
#define SWD_NRF54L15_FICR_VARIANT (SWD_NRF54L15_FICR_NS_BASE + SWD_NRF54L15_FICR_VARIANT_OFFSET)
#define SWD_NRF54L15_FICR_PART_VALUE 0x00054B15

/* UICR Registers */
#define SWD_NRF54L15_UICR_BASE            0x00FFD000
#define SWD_NRF54L15_UICR_SIZE            0x1000
#define SWD_NRF54L15_UICR_OTP_OFFSET      0x0500
#define SWD_NRF54L15_UICR_USER_BASE       (SWD_NRF54L15_UICR_BASE + SWD_NRF54L15_UICR_OTP_OFFSET)
// 319 words of 32 bits (4 bytes) for the OTP area
#define SWD_NRF54L15_UICR_USER_SIZE       (319 * 4)

#endif // _SWD_REGISTERS_NRF54L15_H
